app/controllers/dads_controller.rb

INSERT INTO "dads" ("name", "created_at", "photo_file_size", "updated_at", "photo_file_name", "photo_content_type", "photo_updated_at", "description") VALUES('Michael Maloney', '2010-06-16 17:56:51', 85857, '2010-06-16 17:56:51', '789px-Chinchillapets.jpg', 'image/jpeg', '2010-06-16 17:56:51', 'Stuff')
---
  def create
    @dad = Dad.new(params[:dad])
    if @dad.save

SELECT * FROM "dads" WHERE ("dads"."id" = 1)
---
  def show
    @dad = Dad.find(params[:id])