app/controllers/public_controller.rb

SELECT * FROM "dads" LIMIT 25 OFFSET 0
---
  def home
    @dads = Dad.paginate(:all, :page => params[:page], :per_page => 25, :order=> 'created_at DESC')